---
kind: property
id: P:Autodesk.Revit.DB.MEPConnectorInfo.IsPrimary
source: html/d5cf6738-9ea0-cd57-568b-b72aa5f40a4e.htm
---
# Autodesk.Revit.DB.MEPConnectorInfo.IsPrimary Property

True if this is the primary connector.

## Syntax (C#)
```csharp
public bool IsPrimary { get; }
```